JayHeng/RT-UFL/lib/nxp_evkmimxrt1020_rev.b/flash_algo/Keil_Jlink_ROM_API/Sources/rom/hardware_init_MIMXRT1021.c
/*
 * Copyright 2014-2015 Freescale Semiconductor, Inc.
 * Copyright 2016-2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */

//#include "bl_context.h"
#if BL_FEATURE_RELIABLE_UPDATE
#include "bl_reliable_update.h"
#endif
#include "bootloader_common.h"
#include "fsl_assert.h"
#include "fsl_device_registers.h"
//#include "fsl_lpuart.h"
#if BL_ENABLE_CRC_CHECK
#include "bl_app_crc_check.h"
#endif
#if BL_FEATURE_FLEXSPI_NOR_MODULE || BL_FEATURE_SPINAND_MODULE
#include "bl_flexspi.h"
#include "flexspi_nor_flash.h"
#endif // #if BL_FEATURE_FLEXSPI_NOR_MODULE || BL_FEATURE_SPINAND_MODULE
#if BL_FEATURE_SPI_NOR_EEPROM_MODULE
#include "microseconds.h"
#include "spi_nor_eeprom_memory.h"
#endif // BL_FEATURE_SPI_NOR_EEPROM_MODULE
#if BL_FEATURE_SEMC_NAND_MODULE || BL_FEATURE_SEMC_NOR_MODULE
#include "bl_semc.h"
#endif // #if BL_FEATURE_SEMC_NAND_MODULE || BL_FEATURE_SEMC_NOR_MODULE
#include "bl_api.h"
#include "fusemap.h"
//#include "peripherals_pinmux.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#ifndef FREQ_396MHz
#define FREQ_396MHz (396000000U)
#endif
#ifndef FREQ_480MHz
#define FREQ_480MHz (480000000U)
#endif
#ifndef FREQ_528MHz
#define FREQ_528MHz (528000000U)
#endif
#ifndef FREQ_24MHz
#define FREQ_24MHz (24000000U)
#endif

/*====================== FLEXSPI IOMUXC Definitions ===========================*/
#define SW_MUX_CTL_PAD_FLEXSPIB_DQS_IDX            79
#define SW_MUX_CTL_PAD_FLEXSPIB_DATA3_IDX          81
#define SW_MUX_CTL_PAD_FLEXSPIB_DATA2_IDX          84
#define SW_MUX_CTL_PAD_FLEXSPIB_DATA1_IDX          85
#define SW_MUX_CTL_PAD_FLEXSPIB_DATA0_IDX          83
#define SW_MUX_CTL_PAD_FLEXSPIB_SS0_B_IDX          78
#define SW_MUX_CTL_PAD_FLEXSPIB_SS1_B_IDX          75
#define SW_MUX_CTL_PAD_FLEXSPIB_SCLK_IDX           82

#define SW_MUX_CTL_PAD_FLEXSPIA_DQS_IDX            86
#define SW_MUX_CTL_PAD_FLEXSPIA_SS0_B_IDX          92
#define SW_MUX_CTL_PAD_FLEXSPIA_SS1_B_IDX          74
#define SW_MUX_CTL_PAD_FLEXSPIA_SCLK_IDX           88
#define SW_MUX_CTL_PAD_FLEXSPIA_DATA0_IDX          89
#define SW_MUX_CTL_PAD_FLEXSPIA_DATA1_IDX          91
#define SW_MUX_CTL_PAD_FLEXSPIA_DATA2_IDX          90
#define SW_MUX_CTL_PAD_FLEXSPIA_DATA3_IDX          87
#define SW_MUX_CTL_PAD_FLEXSPIA_SCLK_B_IDX         82

#define SW_PAD_CTL_PAD_FLEXSPIB_DQS_IDX            79
#define SW_PAD_CTL_PAD_FLEXSPIB_DATA3_IDX          81
#define SW_PAD_CTL_PAD_FLEXSPIB_DATA2_IDX          84
#define SW_PAD_CTL_PAD_FLEXSPIB_DATA1_IDX          85
#define SW_PAD_CTL_PAD_FLEXSPIB_DATA0_IDX          83
#define SW_PAD_CTL_PAD_FLEXSPIB_SS0_B_IDX          78
#define SW_PAD_CTL_PAD_FLEXSPIB_SS1_B_IDX          75
#define SW_PAD_CTL_PAD_FLEXSPIB_SCLK_IDX           82

#define SW_PAD_CTL_PAD_FLEXSPIA_DQS_IDX            86
#define SW_PAD_CTL_PAD_FLEXSPIA_SS0_B_IDX          92
#define SW_PAD_CTL_PAD_FLEXSPIA_SS1_B_IDX          74
#define SW_PAD_CTL_PAD_FLEXSPIA_SCLK_IDX           88
#define SW_PAD_CTL_PAD_FLEXSPIA_DATA0_IDX          89
#define SW_PAD_CTL_PAD_FLEXSPIA_DATA1_IDX          91
#define SW_PAD_CTL_PAD_FLEXSPIA_DATA2_IDX          90
#define SW_PAD_CTL_PAD_FLEXSPIA_DATA3_IDX          87
#define SW_PAD_CTL_PAD_FLEXSPIA_SCLK_B_IDX         82

#define FLEXSPIA_MUX_VAL               IOMUXC_SW_MUX_CTL_PAD_MUX_MODE(1)
#define FLEXSPIB_MUX_VAL               IOMUXC_SW_MUX_CTL_PAD_MUX_MODE(1)
#define FLEXSPIA_SS1_MUX_VAL           IOMUXC_SW_MUX_CTL_PAD_MUX_MODE(6)
#define FLEXSPIB_SS1_MUX_VAL           IOMUXC_SW_MUX_CTL_PAD_MUX_MODE(6)
#define FLEXSPIB_SS0_MUX_VAL           IOMUXC_SW_MUX_CTL_PAD_MUX_MODE(6)
#define FLEXSPIB_DQS_MUX_VAL           IOMUXC_SW_MUX_CTL_PAD_MUX_MODE(6)

// Fast Slew Rate
// Driver Strength: R0=260Ohm @3.3V, 150Ohm @1.8V, 240 Ohm for DDR, Actual R = R0/6
// Max Speed : 200MHz
// Pull enabled
// Keeper
#define FLEXSPI_SW_PAD_CTL_VAL    (IOMUXC_SW_PAD_CTL_PAD_SRE(1) | IOMUXC_SW_PAD_CTL_PAD_DSE(6) |   \
                                     IOMUXC_SW_PAD_CTL_PAD_SPEED(3) | IOMUXC_SW_PAD_CTL_PAD_PKE(1) | \
                                     IOMUXC_SW_PAD_CTL_PAD_PUE(0) | IOMUXC_SW_PAD_CTL_PAD_PUS(0))


// Fast Slew Rate
// Driver Strength: R0=260Ohm @3.3V, 150Ohm @1.8V, 240 Ohm for DDR, Acutal R = R0/6
// Max Speed : 200MHz
// Pull enabled
// Pull
// 100k ohm pull down resistor
#define FLEXSPI_DQS_SW_PAD_CTL_VAL    (IOMUXC_SW_PAD_CTL_PAD_SRE(1) | IOMUXC_SW_PAD_CTL_PAD_DSE(6) |   \
                                     IOMUXC_SW_PAD_CTL_PAD_SPEED(3) | IOMUXC_SW_PAD_CTL_PAD_PKE(1) | \
                                     IOMUXC_SW_PAD_CTL_PAD_PUE(1) | IOMUXC_SW_PAD_CTL_PAD_PUS(0) |\
                                     IOMUXC_SW_PAD_CTL_PAD_HYS(1) )


/*====================== FLEXSPI Secondary IOMUXC Definitions ===========================*/
#define SW_MUX_CTL_PAD_FLEXSPIA_SEC_SS0_B_IDX          63
#define SW_MUX_CTL_PAD_FLEXSPIA_SEC_SCLK_IDX           59
#define SW_MUX_CTL_PAD_FLEXSPIA_SEC_DATA0_IDX          60
#define SW_MUX_CTL_PAD_FLEXSPIA_SEC_DATA1_IDX          62
#define SW_MUX_CTL_PAD_FLEXSPIA_SEC_DATA2_IDX          61
#define SW_MUX_CTL_PAD_FLEXSPIA_SEC_DATA3_IDX          58

#define SW_PAD_CTL_PAD_FLEXSPIA_SEC_SS0_B_IDX          63
#define SW_PAD_CTL_PAD_FLEXSPIA_SEC_SCLK_IDX           59
#define SELECT_INPUT_FLEXSPIA_SEC_SCLK_IDX             31
#define SW_PAD_CTL_PAD_FLEXSPIA_SEC_DATA0_IDX          60
#define SELECT_INPUT_FLEXSPIA_SEC_DATA0_IDX            27
#define SW_PAD_CTL_PAD_FLEXSPIA_SEC_DATA1_IDX          62
#define SELECT_INPUT_FLEXSPIA_SEC_DATA1_IDX            28
#define SW_PAD_CTL_PAD_FLEXSPIA_SEC_DATA2_IDX          61
#define SELECT_INPUT_FLEXSPIA_SEC_DATA2_IDX            29
#define SW_PAD_CTL_PAD_FLEXSPIA_SEC_DATA3_IDX          58
#define SELECT_INPUT_FLEXSPIA_SEC_DATA3_IDX            30

#define FLEXSPIA_SEC_MUX_VAL               IOMUXC_SW_MUX_CTL_PAD_MUX_MODE(1)


/*====================== FLEXSPI Reset IOMUXC Definitions ===========================*/
#define SW_MUX_CTL_PAD_FLEXSPI_RESET_IDX              71
#define SW_PAD_CTL_PAD_FLEXSPI_RESET_IDX              71
#define FLEXSPI_RESET_PIN_MUX                         IOMUXC_SW_MUX_CTL_PAD_MUX_MODE(5)
#define FLEXSPI_RESET_PIN_SW_PAD_CTRL_VAL             (IOMUXC_SW_PAD_CTL_PAD_DSE(6) |   \
                                                       IOMUXC_SW_PAD_CTL_PAD_PKE(1) | \
                                                       IOMUXC_SW_PAD_CTL_PAD_PUE(0) | IOMUXC_SW_PAD_CTL_PAD_PUS(0))
#define FLEXSPI_RESET_PIN_GPIO                        GPIO1
#define FLEXSPI_RESET_PIN_INDEX                       29
/*************************************
 *  IVT Data
 *************************************/
typedef struct _ivt_
{
    /** @ref hdr with tag #HAB_TAG_IVT, length and HAB version fields
     *  (see @ref data)
     */
    uint32_t hdr;
    /** Absolute address of the first instruction to execute from the
     *  image
     */
    uint32_t entry;
    /** Reserved in this version of HAB: should be NULL. */
    uint32_t reserved1;
    /** Absolute address of the image DCD: may be NULL. */
    uint32_t dcd;
    /** Absolute address of the Boot Data: may be NULL, but not interpreted
     *  any further by HAB
     */
    uint32_t boot_data;
    /** Absolute address of the IVT.*/
    uint32_t self;
    /** Absolute address of the image CSF.*/
    uint32_t csf;
    /** Reserved in this version of HAB: should be zero. */
    uint32_t reserved2;
} ivt;

#define IVT_MAJOR_VERSION 0x4
#define IVT_MAJOR_VERSION_SHIFT 0x4
#define IVT_MAJOR_VERSION_MASK 0xF
#define IVT_MINOR_VERSION 0x1
#define IVT_MINOR_VERSION_SHIFT 0x0
#define IVT_MINOR_VERSION_MASK 0xF

