JayHeng/RT-UFL/lib/nxp_evkmimxrt1020_rev.b/flash_algo/Keil_Jlink_ROM_API/Sources/rom/hardware_init_MIMXRT1021.c
    return status;
}
#endif // #if BL_FEATURE_FLEXSPI_NOR_MODULE || BL_FEATURE_SPINAND_MODULE

void dummy_byte_callback(uint8_t byte)
{
    (void)byte;
}

void debug_init(void) {}

#if __ICCARM__

size_t __write(int handle, const unsigned char *buf, size_t size)
{
    return size;
}

#endif // __ICCARM__

void update_available_peripherals() {}

void init_hardware(void)
{
    CLOCK_EnableClock(kCLOCK_UsbOh3);

#if BL_TARGET_FLASH
    uint32_t flashVectorTableStart = SCB->VTOR;
    memcpy(s_ramVectorTable, (void *)flashVectorTableStart, sizeof(s_ramVectorTable));
    SCB->VTOR = (uint32_t)s_ramVectorTable;
#endif

#ifdef _DEBUG
    IOMUXC->SW_MUX_CTL_PAD[kIOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_07] = 2;
    IOMUXC->SW_MUX_CTL_PAD[kIOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_06] = 2;
    IOMUXC->SW_PAD_CTL_PAD[kIOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_07] = 0x10f1;
    IOMUXC->SW_PAD_CTL_PAD[kIOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_06] = 0x10f1;
    lpuart_config_t lpuartConfig;
    LPUART_GetDefaultConfig(&lpuartConfig);
    lpuartConfig.baudRate_Bps = 115200;
    lpuartConfig.enableRx = true;
    lpuartConfig.enableTx = true;

    LPUART_Init(DEBUG_UART, &lpuartConfig, 20000000u);
#endif
}

void deinit_hardware(void)
{
    CLOCK_DisableClock(kCLOCK_UsbOh3);
}

//!@brief Write FlexSPI persistent content
status_t flexspi_nor_write_persistent(const uint32_t data)
{
    SRC->GPR[2] = data;

    return kStatus_Success;
}
//!@brief Read FlexSPI persistent content
status_t flexspi_nor_read_persistent(uint32_t *data)
{
    *data = SRC->GPR[2];

    return kStatus_Success;
}

//!@brief Get the hab status.
//habstatus_option_t get_hab_status(void)
//{
//    if (ROM_OCOTP_SEC_CONFIG_VALUE() & 0x2)
//    {
//        return kHabStatus_Close;
//    }
//    else
//    {
//        return kHabStatus_Open;
//    }
//}

void flexspi_update_padsetting(flexspi_mem_config_t *config, uint32_t driveStrength)
{
#define IOMUXC_PAD_SETTING_DSE_SHIFT (3)
#define IOMUXC_PAD_SETTING_DSE_MASK (0x07 << IOMUXC_PAD_SETTING_DSE_SHIFT)
#define IOMUXC_PAD_SETTING_DSE(x) (((x) << IOMUXC_PAD_SETTING_DSE_SHIFT) & IOMUXC_PAD_SETTING_DSE_MASK)
    if (driveStrength)
    {
        config->controllerMiscOption |= FLEXSPI_BITMASK(kFlexSpiMiscOffset_PadSettingOverrideEnable);
        config->dqsPadSettingOverride =
            (FLEXSPI_DQS_SW_PAD_CTL_VAL & ~IOMUXC_PAD_SETTING_DSE_MASK) | IOMUXC_PAD_SETTING_DSE(driveStrength);
        config->sclkPadSettingOverride =
            (FLEXSPI_SW_PAD_CTL_VAL & ~IOMUXC_PAD_SETTING_DSE_MASK) | IOMUXC_PAD_SETTING_DSE(driveStrength);
        config->dataPadSettingOverride =
            (FLEXSPI_SW_PAD_CTL_VAL & ~IOMUXC_PAD_SETTING_DSE_MASK) | IOMUXC_PAD_SETTING_DSE(driveStrength);

        config->csPadSettingOverride =
            (FLEXSPI_DQS_SW_PAD_CTL_VAL & ~IOMUXC_PAD_SETTING_DSE_MASK) | IOMUXC_PAD_SETTING_DSE(driveStrength);
    }
}

//void normal_mem_init(void)
//{
//    typedef struct
//    {
//        uint32_t dtcmSizeKB;
//        uint32_t itcmSizeKB;
//        uint32_t ocramSizeKB;
//    } flexram_cfg_t;

//    const flexram_cfg_t k_flexramCfgList[] = {
//        { 64, 64, 128 }, { 128, 64, 64 }, { 128, 0, 128 },  { 128, 32, 96 }, { 64, 128, 64 }, { 192, 0, 64 },
//        { 64, 32, 160 }, { 64, 0, 192 },  { 256, 64, 192 }, { 32, 64, 160 }, { 32, 128, 96 }, { 32, 160, 64 },
//        { 0, 128, 128 }, { 32, 32, 192 }, { 0, 192, 64 },   { 0, 0, 256 },
//    };

//    uint32_t ramCfgIndex = ROM_OCOTP_FLEXRAM_CFG_VALUE();

//    uint32_t itcmSize = k_flexramCfgList[ramCfgIndex].itcmSizeKB * 1024u;
//    uint32_t dtcmSize = k_flexramCfgList[ramCfgIndex].dtcmSizeKB * 1024u;
//    uint32_t ocramSize = k_flexramCfgList[ramCfgIndex].ocramSizeKB * 1024u;

//    if (itcmSize < 1)
//    {
//        itcmSize = 1;
//    }
//    if (dtcmSize < 1)
//    {
//        dtcmSize = 1;
//    }
//    if (ocramSize < 1)
//    {
//        ocramSize = 1;
//    }

//    g_memoryMap[0].startAddress = 0;
//    g_memoryMap[0].endAddress = g_memoryMap[0].startAddress + itcmSize - 1;
//    g_memoryMap[1].startAddress = 0x20000000;
//    g_memoryMap[1].endAddress = g_memoryMap[1].startAddress + dtcmSize - 1;
//    g_memoryMap[2].startAddress = 0x20200000;
//    g_memoryMap[2].endAddress = g_memoryMap[2].startAddress + ocramSize - 1;
//}

//status_t target_load_bootloader_config_area(bootloader_configuration_data_t *config)
//{
//    memcpy(config, (void *)kBootloaderConfigAreaAddress, sizeof(bootloader_configuration_data_t));

//    return kStatus_Success;
//}

#if BL_FEATURE_RELIABLE_UPDATE
typedef struct
{
    status_t (*erase)(uint32_t start, uint32_t lengthInbytes);
    status_t (*program)(uint32_t start, uint8_t *src, uint32_t length);
} flash_driver_interface_t;

typedef struct
{
    uint32_t version;
    status_t (*get_update_partition_info)(partition_t *partition);
    status_t (*update_image_state)(uint32_t state);
    status_t (*get_image_state)(uint32_t *state);
    status_t (*update_image_state_user_api)(uint32_t state, flash_driver_interface_t *flashIf);
    status_t (*update_partition_table_user_api)(partition_t *partition,
                                                uint32_t entries,
                                                flash_driver_interface_t *flashIf);
} reliable_update_interface_t;

status_t api_update_swap_meta(swap_meta_t *swap_meta)
{
    status_t status = kStatus_Fail;
    swap_meta_t swap_metas[2];
    for (uint32_t i = 0; i < 2; i++)
    {
        uint32_t meta_addr = BL_FEATURE_SWAP_META_START + i * BL_FEATURE_FLASH_SECTOR_SIZE;
        memcpy((uint8_t *)&swap_metas[i], (void *)meta_addr, sizeof(swap_meta_t));
    }

    uint32_t update_idx = 0;
    if ((kStatus_Success != swap_meta_check(&swap_metas[0])) && (kStatus_Success != swap_meta_check(&swap_metas[1])))
    {
        update_idx = 0;
    }
    else if ((kStatus_Success == swap_meta_check(&swap_metas[0])) &&
             (kStatus_Success != swap_meta_check(&swap_metas[1])))
    {
        update_idx = 1;
    }
    else if ((kStatus_Success != swap_meta_check(&swap_metas[0])) &&
             (kStatus_Success == swap_meta_check(&swap_metas[1])))
    {
        update_idx = 0;
    }
    else if ((kStatus_Success == swap_meta_check(&swap_metas[0])) &&
             (kStatus_Success == swap_meta_check(&swap_metas[1])))
    {
        update_idx = (swap_metas[0].meta_version > swap_metas[1].meta_version) ? 1 : 0;
    }

    uint32_t meta_addr = BL_FEATURE_SWAP_META_START + update_idx * BL_FEATURE_FLASH_SECTOR_SIZE;

    swap_meta->meta_version++;

