JayHeng/RT-UFL/lib/nxp_evkmimxrt1020_rev.b/flash_algo/Keil_Jlink_ROM_API/Sources/rom/hardware_init_MIMXRT1021.c
    flexspi_nor_config_t flashNorConfig;
    memcpy(&flashNorConfig, (void *)BL_FLEXSPI_AMBA_BASE, sizeof(flashNorConfig));

    uint32_t instance = BL_FEATURE_FLEXSPI_NOR_MODULE_PERIPHERAL_INSTANCE;
    __disable_irq();
    status = flexspi_nor_flash_init(instance, &flashNorConfig);
    __enable_irq();
    uint32_t programBuffer[128];
    memset(programBuffer, 0xff, sizeof(programBuffer));

    do
    {
        uint32_t erase_addr = meta_addr - BL_FLEXSPI_AMBA_BASE;
        __disable_irq();
        status = flexspi_nor_flash_erase(instance, &flashNorConfig, erase_addr, BL_FEATURE_FLASH_SECTOR_SIZE);
        __enable_irq();
        if (status != kStatus_Success)
        {
            break;
        }

        memcpy(programBuffer, swap_meta, sizeof(*swap_meta));
        __disable_irq();
        status = flexspi_nor_flash_page_program(instance, &flashNorConfig, erase_addr, programBuffer);
        __enable_irq();
        if (status != kStatus_Success)
        {
            break;
        }

    } while (0);

    return status;
}

status_t app_api_update_swap_meta(swap_meta_t *swap_meta, flash_driver_interface_t *flashIf)
{
    status_t status = kStatus_Fail;
    swap_meta_t swap_metas[2];
    for (uint32_t i = 0; i < 2; i++)
    {
        uint32_t meta_addr = BL_FEATURE_SWAP_META_START + i * BL_FEATURE_FLASH_SECTOR_SIZE;
        memcpy((uint8_t *)&swap_metas[i], (void *)meta_addr, sizeof(swap_meta_t));
    }

    uint32_t update_idx = 0;
    if ((kStatus_Success != swap_meta_check(&swap_metas[0])) && (kStatus_Success != swap_meta_check(&swap_metas[1])))
    {
        update_idx = 0;
    }
    else if ((kStatus_Success == swap_meta_check(&swap_metas[0])) &&
             (kStatus_Success != swap_meta_check(&swap_metas[1])))
    {
        update_idx = 1;
    }
    else if ((kStatus_Success != swap_meta_check(&swap_metas[0])) &&
             (kStatus_Success == swap_meta_check(&swap_metas[1])))
    {
        update_idx = 0;
    }
    else if ((kStatus_Success == swap_meta_check(&swap_metas[0])) &&
             (kStatus_Success == swap_meta_check(&swap_metas[1])))
    {
        update_idx = (swap_metas[0].meta_version > swap_metas[1].meta_version) ? 1 : 0;
    }

    uint32_t meta_addr = BL_FEATURE_SWAP_META_START + update_idx * BL_FEATURE_FLASH_SECTOR_SIZE;

    swap_meta->meta_version++;
    do
    {
        uint32_t erase_addr = meta_addr - BL_FLEXSPI_AMBA_BASE;
        // Ensure that the program operation cannots be interrupted.
        uint32_t regPrimask = 0U;
        regPrimask = __get_PRIMASK();
        __disable_irq();
        status = flashIf->erase(erase_addr, BL_FEATURE_FLASH_SECTOR_SIZE);
        __set_PRIMASK(regPrimask);
        if (status != kStatus_Success)
        {
            break;
        }
        regPrimask = __get_PRIMASK();
        __disable_irq();
        status = flashIf->program(erase_addr, (uint8_t *)swap_meta, sizeof(*swap_meta));
        __set_PRIMASK(regPrimask);
        if (status != kStatus_Success)
        {
            break;
        }

    } while (0);

    return status;
}

status_t app_api_update_boot_meta(bootloader_meta_t *boot_meta, flash_driver_interface_t *flashIf)
{
    status_t status = kStatus_Fail;
    bootloader_meta_t boot_metas[2];
    for (uint32_t i = 0; i < 2; i++)
    {
        uint32_t meta_addr = BL_FEATURE_BOOT_META_START + i * BL_FEATURE_FLASH_SECTOR_SIZE;
        memcpy((uint8_t *)&boot_metas[i], (void *)meta_addr, sizeof(boot_metas[i]));
    }

    uint32_t update_idx = 0;
    if ((kStatus_Success != boot_meta_check(&boot_metas[0])) && (kStatus_Success != boot_meta_check(&boot_metas[1])))
    {
        update_idx = 0;
    }
    else if ((kStatus_Success == boot_meta_check(&boot_metas[0])) &&
             (kStatus_Success != boot_meta_check(&boot_metas[1])))
    {
        update_idx = 1;
    }
    else if ((kStatus_Success != boot_meta_check(&boot_metas[0])) &&
             (kStatus_Success == boot_meta_check(&boot_metas[1])))
    {
        update_idx = 0;
    }
    else if ((kStatus_Success == boot_meta_check(&boot_metas[0])) &&
             (kStatus_Success == boot_meta_check(&boot_metas[1])))
    {
        update_idx = (boot_metas[0].meta_version > boot_metas[1].meta_version) ? 1 : 0;
    }

    uint32_t meta_addr = BL_FEATURE_BOOT_META_START + update_idx * BL_FEATURE_FLASH_SECTOR_SIZE;

    boot_metas->meta_version++;
    do
    {
        uint32_t erase_addr = meta_addr - BL_FLEXSPI_AMBA_BASE;
        // Ensure that the program operation cannots be interrupted.
        uint32_t regPrimask = 0U;
        regPrimask = __get_PRIMASK();
        __disable_irq();
        status = flashIf->erase(erase_addr, BL_FEATURE_FLASH_SECTOR_SIZE);
        __set_PRIMASK(regPrimask);
        if (status != kStatus_Success)
        {
            break;
        }
        regPrimask = __get_PRIMASK();
        __disable_irq();
        status = flashIf->program(erase_addr, (uint8_t *)boot_meta, sizeof(*boot_meta));
        __set_PRIMASK(regPrimask);
        if (status != kStatus_Success)
        {
            break;
        }

    } while (0);

    return status;
}

status_t get_update_partition_info(partition_t *partition)
{
    bootloader_meta_t boot_meta;
    status_t status = load_boot_meta(&boot_meta);
    if (status != kStatus_Success)
    {
        return status;
    }
    memcpy(partition, &boot_meta.partition[kPartition_Secondary], sizeof(*partition));

    return kStatus_Success;
}

status_t update_partition_table_user_api(partition_t *partition, uint32_t entries, flash_driver_interface_t *flashIf)
{
    bootloader_meta_t boot_meta;
    bool has_boot_meta = false;

    if ((flashIf == NULL) || (entries > ARRAY_SIZE(boot_meta.partition)))
    {
        return kStatus_InvalidArgument;
    }

    status_t status = load_boot_meta(&boot_meta);
    if (status == kStatus_Success)
    {
        has_boot_meta = true;
    }

    if (!has_boot_meta)
    {
        memset(&boot_meta, 0, sizeof(boot_meta));
        boot_meta.tag = BOOTLOADER_META_TAG;
        boot_meta.features.enabledPeripherals = 0xffffffffu;
        boot_meta.features.periphDetectTimeout = 0xffffffffu;
        boot_meta.features.wdTimeout = 0xffffffffu;
    }

    boot_meta.patition_entries = entries;
    memcpy(&boot_meta.partition, partition, entries * sizeof(*partition));
    status = app_api_update_boot_meta(&boot_meta, flashIf);

