JayHeng/RT-UFL/lib/nxp_evkmimxrt1020_rev.b/flash_algo/Keil_Jlink_ROM_API/Sources/rom/hardware_init_MIMXRT1021.c
    return status;
}

status_t update_image_state(uint32_t state)
{
    swap_meta_t swap_meta;
    status_t status = load_swap_meta(&swap_meta);
    if (status != kStatus_Success)
    {
        return status;
    }

    if (state == kSwapType_ReadyForTest)
    {
        image_header_t boot_header;
        get_image_header(kPartition_Secondary, &boot_header);
        if (boot_image_check(&boot_header, kPartition_Secondary) == kStatus_Success)
        {
            swap_meta.swap_type = kSwapType_ReadyForTest;
            swap_meta.copy_status = 0;
            swap_meta.swap_progress.swap_offset = 0;
            swap_meta.swap_progress.swap_status = kSwapStage_NotStarted;
            swap_meta.image_info[1].size = boot_header.image_size + boot_header.header_size;
            swap_meta.confirm_info = 0;
            api_update_swap_meta(&swap_meta);
            return kStatus_Success;
        }
        else
        {
            return kStatus_Fail;
        }
    }
    else if (state == kSwapType_Permanent)
    {
        swap_meta.copy_status = 0;
        swap_meta.swap_progress.swap_offset = 0;
        swap_meta.swap_progress.swap_status = kSwapStage_NotStarted;
        swap_meta.confirm_info = kImageConfirm_Okay;
        swap_meta.swap_type = kSwapType_Permanent;
        api_update_swap_meta(&swap_meta);
        return kStatus_Success;
    }
    else
    {
        return kStatus_InvalidArgument;
    }
}

status_t update_image_state_user_api(uint32_t state, flash_driver_interface_t *flashIf)
{
    swap_meta_t swap_meta;
    status_t status = load_swap_meta(&swap_meta);
    if (status != kStatus_Success)
    {
        return status;
    }

    if (state == kSwapType_ReadyForTest)
    {
        image_header_t boot_header;
        get_image_header(kPartition_Secondary, &boot_header);
        if (boot_image_check(&boot_header, kPartition_Secondary) == kStatus_Success)
        {
            swap_meta.swap_type = kSwapType_ReadyForTest;
            swap_meta.copy_status = 0;
            swap_meta.swap_progress.swap_offset = 0;
            swap_meta.swap_progress.swap_status = kSwapStage_NotStarted;
            swap_meta.image_info[1].size = boot_header.image_size + boot_header.header_size;
            swap_meta.confirm_info = 0;
            app_api_update_swap_meta(&swap_meta, flashIf);
            return kStatus_Success;
        }
        else
        {
            return kStatus_Fail;
        }
    }
    else if (state == kSwapType_Permanent)
    {
        swap_meta.copy_status = 0;
        swap_meta.swap_progress.swap_offset = 0;
        swap_meta.swap_progress.swap_status = kSwapStage_NotStarted;
        swap_meta.confirm_info = kImageConfirm_Okay;
        swap_meta.swap_type = kSwapType_Permanent;
        app_api_update_swap_meta(&swap_meta, flashIf);
        return kStatus_Success;
    }
    else
    {
        return kStatus_InvalidArgument;
    }
}

status_t get_image_state(uint32_t *state)
{
    swap_meta_t swap_meta;
    status_t status = load_swap_meta(&swap_meta);
    if (status != kStatus_Success)
    {
        return status;
    }
    *state = swap_meta.swap_type;

    return status;
}

__USED const reliable_update_interface_t g_reliableUpdateAPI = {
    MAKE_VERSION(1, 0, 0),
    .get_update_partition_info = get_update_partition_info,
    .update_image_state = update_image_state,
    .get_image_state = get_image_state,
    .update_image_state_user_api = update_image_state_user_api,
    .update_partition_table_user_api = update_partition_table_user_api,
};
#else
__USED const uint32_t g_reliableUpdateAPI = 0;
#endif //#if BL_FEATURE_RELIABLE_UPDATE

////////////////////////////////////////////////////////////////////////////////
// EOF
////////////////////////////////////////////////////////////////////////////////
